Revit 2026 API

# FamilyTypeAsDouble Method

---

Provides access to the double precision number of the given family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double? AsDouble(
	FamilyParameter familyParameter
)
```
```vb
Public Function AsDouble (
	familyParameter As FamilyParameter
) As Double?
```
```cpp
public:
Nullable<double> AsDouble(
	FamilyParameter^ familyParameter
)
```
```fsharp
member AsDouble :
        familyParameter : FamilyParameter -> Nullable<float>
```

#### Parameters

familyParameter FamilyParameter

#### Return Value

NullableDoubleThe double value contained in the parameter. Returns  if the storage type of the input argument is not double type or this parameter has no value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown if the input argument-"familyParameter"-is invalid, |

#### Reference

FamilyType Class

Autodesk.Revit.DB Namespace